[
  {
    "id": 1,
    "name": "Lingo Bingo",
    "image": "https://i.ibb.co.com/2vxpZWx/Screenshot-2025-01-05-001030.png",
    "techStack": "React, Firebase, Tailwind CSS, React Router DOM, React CountUp, AOS, React Toastify",
    "description": "Lingo Bingo is a fun and interactive language learning application designed to help users expand their vocabulary and improve communication skills in a specific language. With features like vocabulary lessons, tutorials, and audio pronunciation, this app makes learning enjoyable and effective.",
    "liveLink": "https://lingo-bingo.netlify.app",
    "githubLink": "https://github.com/arifhassansky/lingo-bingo",
    "challenges": "Faced challenges in implementing responsive design across multiple devices and integrating Google Sign-In with Firebase for user authentication.",
    "improvements": "Planning to enhance the performance by optimizing images, lazy loading, adding more language support, and incorporating interactive quizzes."
  },
  {
    "id": 2,
    "name": "Visa Navigator Portal",
    "image": "https://i.ibb.co.com/vdR5Zsq/Screenshot-2025-01-05-001156.png",
    "techStack": "React, Tailwind CSS, Node.js, Express.js, MongoDB, Firebase, React Router DOM",
    "description": "Visa Navigator Portal simplifies the visa application process with a user-friendly platform. It helps users check visa requirements, apply online, and track their application status in real-time. With a secure and responsive design, the portal provides a seamless experience for travelers, students, and job seekers.",
    "liveLink": "https://visa-navigator.netlify.app",
    "githubLink": "https://github.com/arifhassansky/visa-navigator-client",
    "challenges": "Struggled with integrating real-time application tracking and ensuring secure authentication through Firebase.",
    "improvements": "Planning to implement multilingual support, enhance data filtering options, and improve overall performance with optimization techniques."
  },
  {
    "id": 3,
    "name": "Roomify Platform",
    "image": "https://i.ibb.co.com/6PyDQKV/Screenshot-2025-01-05-001306.png",
    "techStack": "React, Express JS, Tailwind CSS, Firebase, React Router, React Icons, React Modal, React Slick, React Leaflet",
    "description": "Roomify Platform is a hotel booking solution that offers users a seamless experience to explore, book, and manage hotel rooms with secure authentication. With a user-friendly interface, interactive features, and robust booking management, this platform ensures a smooth experience for travelers.",
    "liveLink": "https://roomifysky.netlify.app",
    "githubLink": "https://github.com/arifhassansky/roomify",
    "challenges": "Faced challenges with integrating interactive maps and ensuring smooth real-time authentication via Firebase.",
    "improvements": "Planning to enhance room search functionality, improve performance, and add multi-language support."
  }
]
